In [376]:
import warnings
warnings.filterwarnings("ignore")

In [377]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [378]:
calls = pd.read_csv('datasets/megaline_calls.csv')

In [379]:
messages = pd.read_csv('datasets/megaline_messages.csv')

In [380]:
internet = pd.read_csv('datasets/megaline_internet.csv')

In [381]:
users = pd.read_csv('datasets/megaline_users1.csv')

In [382]:
plans = pd.read_csv('datasets/megaline_plans.csv')

In [383]:
calls.head()

         id  user_id   call_date  duration
0   1000_93     1000  2018-12-27      8.52
1  1000_145     1000  2018-12-27     13.66
2  1000_247     1000  2018-12-27     14.48
3  1000_309     1000  2018-12-28      5.76
4  1000_380     1000  2018-12-30      4.22

In [384]:
calls.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 137735 entries, 0 to 137734
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   id         137735 non-null  object
 1   user_id    137735 non-null  int64
 2   call_date  137735 non-null  object
 3   duration   137735 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 4.2+ MB

In [385]:
messages.head()

         id  user_id message_date
0  1000_125     1000   2018-12-27
1  1000_160     1000   2018-12-31
2  1000_223     1000   2018-12-31
3  1000_251     1000   2018-12-27
4  1000_255     1000   2018-12-26

In [386]:
messages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76051 entries, 0 to 76050
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            76051 non-null  object
 1   user_id       76051 non-null  int64
 2   message_date  76051 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.7+ MB

In [387]:
internet.head()

         id  user_id session_date  mb_used
0   1000_13     1000   2018-12-29    89.86
1  1000_204     1000   2018-12-31     0.00
2  1000_379     1000   2018-12-28   660.40
3  1000_413     1000   2018-12-26   270.99
4  1000_442     1000   2018-12-27   880.22

In [388]:
internet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 104825 entries, 0 to 104824
Data columns (total 4 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   id            104825 non-null  object
 1   user_id       104825 non-null  int64
 2   session_date  104825 non-null  object
 3   mb_used       104825 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 3.2+ MB

In [389]:
users.head()

,user_id,first_name,last_name,age,city,reg_date,plan,churn_date
0,1000,Anamaria,Bauer,45,"Atlanta-Sandy Springs-Roswell, GA MSA",2018-12-24,ultimate,NaN
1,1001,Mickey,Wilkerson,28,"Seattle-Tacoma-Bellevue, WA MSA",2018-08-13,surf,NaN
2,1002,Carlee,Hoffman,36,"Las Vegas-Henderson-Paradise, NV MSA",2018-10-21,surf,NaN
3,1003,Reynaldo,Jenkins,52,"Tulsa, OK MSA",2018-01-28,surf,NaN
4,1004,Leonila,Thompson,40,"Seattle-Tacoma-Bellevue, WA MSA",2018-05-23,surf,NaN

In [390]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     500 non-null    int64
 1   first_name  500 non-null    object
 2   last_name   500 non-null    object
 3   age         500 non-null    int64
 4   city        500 non-null    object
 5   reg_date    500 non-null    object
 6   plan        500 non-null    object
 7   churn_date  34 non-null     object
dtypes: int64(2), object(6)
memory usage: 31.4+ KB

In [391]:
users['reg_date'] = pd.to_datetime(users['reg_date'], format='%Y-%m-%d')

In [392]:
#users['churn_date'].fillna(value='2019-01-01', inplace=True)

In [393]:
users['churn_date'] = pd.to_datetime(users['churn_date'], format='%Y-%m-%d')

In [394]:
plans.head()

,messages_included,mb_per_month_included,minutes_included,usd_monthly_pay,usd_per_gb,usd_per_message,usd_per_minute,plan_name
0,50,15360,500,20,10,0.03,0.03,surf
1,1000,30720,3000,70,7,0.01,0.01,ultimate

### Create a report

In [395]:
users['reg_month'] = users['reg_date'].values.astype('datetime64[M]')
#create a reg_month column

In [396]:
users['churn_month'] = users['churn_date'].values.astype('datetime64[M]')

In [397]:
min_month = users['reg_date'].values.astype('datetime64[M]').min()
#minimum month

In [398]:
max_month = users['reg_date'].values.astype('datetime64[M]').max()
#maximum month

In [399]:
(min_month, max_month)
#range of minimum and maximum

(numpy.datetime64('2018-01'), numpy.datetime64('2018-12'))

In [400]:
months = pd.DataFrame(pd.date_range(min_month, max_month, freq='MS'))
#create a dataframe of the months

In [401]:
months

            0
0  2018-01-01
1  2018-02-01
2  2018-03-01
3  2018-04-01
4  2018-05-01
5  2018-06-01
6  2018-07-01
7  2018-08-01
8  2018-09-01
9  2018-10-01
10 2018-11-01
11 2018-12-01

In [402]:
months.columns = ['month'] #rename the month column

In [403]:
len(users)*len(months) #check length of merging each user with each month

6000

In [404]:
users['key'] = 1
months['key'] = 1
#create a uniform key to merge the 2df on

In [405]:
report = months.merge(users, on='key')
#the merge

In [406]:
users[users['churn_date'].notna()].head()

,user_id,first_name,last_name,age,city,reg_date,plan,churn_date,reg_month,churn_month,key
6,1006,Jesusa,Bradford,73,"San Francisco-Oakland-Berkeley, CA MSA",2018-11-27,ultimate,2018-12-18,2018-11-01,2018-12-01,1
12,1012,Jonelle,Mcbride,59,"Chicago-Naperville-Elgin, IL-IN-WI MSA",2018-06-28,surf,2018-11-16,2018-06-01,2018-11-01,1
22,1022,Bo,Snow,73,"New York-Newark-Jersey City, NY-NJ-PA MSA",2018-04-20,surf,2018-09-07,2018-04-01,2018-09-01,1
40,1040,Paris,Santos,72,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD MSA",2018-12-23,surf,2018-12-30,2018-12-01,2018-12-01,1
50,1050,Jone,Owen,23,"Miami-Fort Lauderdale-West Palm Beach, FL MSA",2018-03-20,ultimate,2018-10-07,2018-03-01,2018-10-01,1

In [407]:
users.head()

,user_id,first_name,last_name,age,city,reg_date,plan,churn_date,reg_month,churn_month,key
0,1000,Anamaria,Bauer,45,"Atlanta-Sandy Springs-Roswell, GA MSA",2018-12-24,ultimate,NaT,2018-12-01,NaT,1
1,1001,Mickey,Wilkerson,28,"Seattle-Tacoma-Bellevue, WA MSA",2018-08-13,surf,NaT,2018-08-01,NaT,1
2,1002,Carlee,Hoffman,36,"Las Vegas-Henderson-Paradise, NV MSA",2018-10-21,surf,NaT,2018-10-01,NaT,1
3,1003,Reynaldo,Jenkins,52,"Tulsa, OK MSA",2018-01-28,surf,NaT,2018-01-01,NaT,1
4,1004,Leonila,Thompson,40,"Seattle-Tacoma-Bellevue, WA MSA",2018-05-23,surf,NaT,2018-05-01,NaT,1

In [408]:
report.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6000 entries, 0 to 5999
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   month        6000 non-null   datetime64[ns]
 1   key          6000 non-null   int64
 2   user_id      6000 non-null   int64
 3   first_name   6000 non-null   object
 4   last_name    6000 non-null   object
 5   age          6000 non-null   int64
 6   city         6000 non-null   object
 7   reg_date     6000 non-null   datetime64[ns]
 8   plan         6000 non-null   object
 9   churn_date   408 non-null    datetime64[ns]
 10  reg_month    6000 non-null   datetime64[ns]
 11  churn_month  408 non-null    datetime64[ns]
dtypes: datetime64[ns](5), int64(3), object(4)
memory usage: 609.4+ KB

In [409]:
len(report[report['month']>=report['reg_month']]) #some users came after the minimal date

3355

In [410]:
#some users left before the maximum date
len(report[report['month'] <= report['churn_month']])

366

In [411]:
report = report[report['month'] >= report['reg_month']] 
# select month for user after registration

In [412]:
#report = report[report['month'] <= report['churn_month']]

In [413]:
report.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3355 entries, 3 to 5999
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   month        3355 non-null   datetime64[ns]
 1   key          3355 non-null   int64
 2   user_id      3355 non-null   int64
 3   first_name   3355 non-null   object
 4   last_name    3355 non-null   object
 5   age          3355 non-null   int64
 6   city         3355 non-null   object
 7   reg_date     3355 non-null   datetime64[ns]
 8   plan         3355 non-null   object
 9   churn_date   234 non-null    datetime64[ns]
 10  reg_month    3355 non-null   datetime64[ns]
 11  churn_month  234 non-null    datetime64[ns]
dtypes: datetime64[ns](5), int64(3), object(4)
memory usage: 340.7+ KB

In [414]:
report = report[['month', 'key', 'user_id', 'city', 'plan', 'reg_month']] #select only wanted columns

In [415]:
#specific user
report[report['user_id'] == 1000]

,month,key,user_id,city,plan,reg_month
5500,2018-12-01,1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,2018-12-01

In [416]:
report[report['user_id'] == 1003]

          month  key  user_id           city  plan  reg_month
3    2018-01-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
503  2018-02-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
1003 2018-03-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
1503 2018-04-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
2003 2018-05-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
2503 2018-06-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
3003 2018-07-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
3503 2018-08-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
4003 2018-09-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
4503 2018-10-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
5003 2018-11-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
5503 2018-12-01    1     1003  Tulsa, OK MSA  surf 2018-01-01

### Calls

In [417]:
data = users[['user_id', 'city', 'plan']]
#take specific columns from users

In [418]:
data_calls = data.merge(calls, how='outer', on='user_id')
#merge on data with calls by the outer

In [419]:
data_calls.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 137754 entries, 0 to 137753
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   user_id    137754 non-null  int64
 1   city       137754 non-null  object
 2   plan       137754 non-null  object
 3   id         137735 non-null  object
 4   call_date  137735 non-null  object
 5   duration   137735 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 7.4+ MB

In [420]:
data_calls.head()

,user_id,city,plan,id,call_date,duration
0,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_93,2018-12-27,8.52
1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_145,2018-12-27,13.66
2,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_247,2018-12-27,14.48
3,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_309,2018-12-28,5.76
4,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_380,2018-12-30,4.22

In [421]:
data_calls['call_date'] = pd.to_datetime(data_calls['call_date'], format='%Y-%m-%d')

In [422]:
data_calls['month'] = data_calls['call_date'].values.astype('datetime64[M]')
#create a month column of datetime

In [423]:
calls_month = data_calls.groupby(['user_id', 'month'])[['duration']].agg(['sum']).reset_index()
#create a groupby which has the sum of call duration for each user in each month

In [424]:
calls_month.sample(10)

     user_id      month duration
                             sum
716     1155 2018-05-01   215.61
1613    1357 2018-10-01    49.04
1410    1313 2018-11-01   652.64
1861    1405 2018-11-01   154.48
2049    1450 2018-12-01   649.10
2096    1462 2018-12-01   421.54
1291    1281 2018-09-01   564.24
1039    1223 2018-12-01   511.91
447     1097 2018-10-01   652.71
27      1008 2018-11-01   422.81

In [425]:
calls_month.columns = ['user_id', 'month', 'total_duration'] # maybe round up the duration at this point

In [426]:
#round up the minutes to the nearest whole number
calls_month['total_duration'] = calls_month['total_duration'].round(0)

In [427]:
user_plan = users[['user_id', 'plan']]
#select each user and there plan to be the dictionary values for merging

In [428]:
user_plan[user_plan['user_id'] == 1233] #testing

     user_id  plan
233     1233  surf

In [429]:
calls_month = calls_month.merge(user_plan, on='user_id', how='left')
#merge to find each users plan, in each month.

In [430]:
plans
#look at plans

,messages_included,mb_per_month_included,minutes_included,usd_monthly_pay,usd_per_gb,usd_per_message,usd_per_minute,plan_name
0,50,15360,500,20,10,0.03,0.03,surf
1,1000,30720,3000,70,7,0.01,0.01,ultimate

In [431]:
call_plan = plans[['plan_name', 'minutes_included']]
#a df for minutes included in each plan

In [432]:
call_plan.columns = ['plan', 'plan_minutes']
#change the column names

In [433]:
call_plan
#check

       plan  plan_minutes
0      surf           500
1  ultimate          3000

In [434]:
calls_month = calls_month.merge(call_plan, on='plan', how='left')
#merge each user with their minutes included for their plan, in each month

In [435]:
calls_month['extra_mins'] = calls_month['total_duration'] - calls_month['plan_minutes']
#calculate the extra minutes used every month according tomplan package

In [436]:
#calls_month['extra_mins'] = calls_month['extra_mins'].round(0) #round up the minutes

In [437]:
#change mins to integer
#calls_month['extra_mins'] = calls_month['extra_mins'].astype(np.int64)

In [438]:
#a function to change the -ve values to zero
def count_calc(extra):
    if extra < 0:
        return 0
    if extra == 0:
        return 0
    if extra > 0:
        return extra

In [439]:
calls_month['extra_duration'] = calls_month['extra_mins'].apply(count_calc)
#apply the function to the column

In [440]:
extraminute_plan = plans[['plan_name', 'usd_per_minute']]
# a df to use as key for extra mins in each plan

In [441]:
extraminute_plan.columns = ['plan', 'usd_per_minute']
#change the columns

In [442]:
calls_month = calls_month.merge(extraminute_plan, on='plan', how='left')
#merge each extra minute cost to the calls

In [443]:
calls_month['call_cost'] = calls_month['extra_duration'] * calls_month['usd_per_minute']
#create a cost column of extra mintes used

In [444]:
calls_month = calls_month[['user_id', 'month', 'call_cost']]
#select required columns

In [445]:
report = report.merge(calls_month, on=['user_id', 'month'], how='left')
#merge with the report

In [446]:
report.shape

(3355, 7)

In [447]:
calls_month.shape

(2258, 3)

In [448]:
report.head()
#NaN are for users who did not make calls that month
#0.0 are for users who had no extra cost

,month,key,user_id,city,plan,reg_month,call_cost
0,2018-01-01,1,1003,"Tulsa, OK MSA",surf,2018-01-01,NaN
1,2018-01-01,1,1011,"Cleveland-Elyria, OH MSA",ultimate,2018-01-01,NaN
2,2018-01-01,1,1019,"Jacksonville, FL MSA",surf,2018-01-01,NaN
3,2018-01-01,1,1029,"Tampa-St. Petersburg-Clearwater, FL MSA",surf,2018-01-01,NaN
4,2018-01-01,1,1042,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD MSA",surf,2018-01-01,0.0

### Messages

In [449]:
data.head()

   user_id                                   city      plan
0     1000  Atlanta-Sandy Springs-Roswell, GA MSA  ultimate
1     1001        Seattle-Tacoma-Bellevue, WA MSA      surf
2     1002   Las Vegas-Henderson-Paradise, NV MSA      surf
3     1003                          Tulsa, OK MSA      surf
4     1004        Seattle-Tacoma-Bellevue, WA MSA      surf

In [450]:
messages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76051 entries, 0 to 76050
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            76051 non-null  object
 1   user_id       76051 non-null  int64
 2   message_date  76051 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.7+ MB

In [451]:
data_messages = data.merge(messages, on='user_id', how='right')

In [452]:
data_messages['message_date'] = pd.to_datetime(data_messages['message_date'], format='%Y-%m-%d')

In [453]:
data_messages['id'].duplicated().sum()
#all messages are unique, so they each get a count of 1.

0

In [454]:
data_messages['msg_count'] = 1

In [455]:
data_messages.head()

,user_id,city,plan,id,message_date,msg_count
0,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_125,2018-12-27,1
1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_160,2018-12-31,1
2,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_223,2018-12-31,1
3,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_251,2018-12-27,1
4,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_255,2018-12-26,1

In [456]:
data_messages['month'] = data_messages['message_date'].values.astype('datetime64[M]')

In [457]:
msg_month = data_messages.groupby(['user_id', 'month'])[['msg_count']].agg(['sum']).reset_index()

In [458]:
msg_month.sample(10)

     user_id      month msg_count
                              sum
1370    1365 2018-08-01        53
142     1053 2018-09-01        21
800     1213 2018-12-01        85
185     1060 2018-09-01        66
578     1155 2018-09-01        47
210     1064 2018-09-01        25
614     1165 2018-10-01         2
479     1132 2018-05-01       149
120     1043 2018-10-01        87
894     1242 2018-10-01        66

In [459]:
msg_month.columns = ['user_id', 'month', 'total_msg']

In [460]:
msg_month = msg_month.merge(user_plan, on='user_id', how='left')

In [461]:
msg_plan = plans[['plan_name', 'messages_included']]
msg_plan.columns = ['plan', 'plan_messages']

In [462]:
msg_plan

       plan  plan_messages
0      surf             50
1  ultimate           1000

In [463]:
msg_month = msg_month.merge(msg_plan, on='plan', how='left')

In [464]:
msg_month['xtra_msg'] = msg_month['total_msg'] - msg_month['plan_messages']

In [465]:
msg_month['xtra_txt'] = msg_month['xtra_msg'].apply(count_calc)

In [466]:
extramsg_plan = plans[['plan_name', 'usd_per_message']]

In [467]:
extramsg_plan.columns = ['plan', 'usd_per_message']

In [468]:
msg_month = msg_month.merge(extramsg_plan, on='plan', how='left')

In [469]:
msg_month['msg_cost'] = msg_month['xtra_txt'] * msg_month['usd_per_message']

In [470]:
msg_month = msg_month[['user_id', 'month', 'msg_cost']]

In [471]:
report.head()

,month,key,user_id,city,plan,reg_month,call_cost
0,2018-01-01,1,1003,"Tulsa, OK MSA",surf,2018-01-01,NaN
1,2018-01-01,1,1011,"Cleveland-Elyria, OH MSA",ultimate,2018-01-01,NaN
2,2018-01-01,1,1019,"Jacksonville, FL MSA",surf,2018-01-01,NaN
3,2018-01-01,1,1029,"Tampa-St. Petersburg-Clearwater, FL MSA",surf,2018-01-01,NaN
4,2018-01-01,1,1042,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD MSA",surf,2018-01-01,0.0

In [472]:
report.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3355 entries, 0 to 3354
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   month      3355 non-null   datetime64[ns]
 1   key        3355 non-null   int64
 2   user_id    3355 non-null   int64
 3   city       3355 non-null   object
 4   plan       3355 non-null   object
 5   reg_month  3355 non-null   datetime64[ns]
 6   call_cost  2258 non-null   float64
dtypes: datetime64[ns](2), float64(1), int64(2), object(2)
memory usage: 209.7+ KB

In [473]:
report = report.merge(msg_month, on=['user_id', 'month'], how='left')

In [474]:
report.shape[0]

3355

### Internet

In [475]:
#convert to GB

In [476]:
data_internet = data.merge(internet, how='right', on='user_id')

In [477]:
data_internet.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 104825 entries, 0 to 104824
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       104825 non-null  int64
 1   city          104825 non-null  object
 2   plan          104825 non-null  object
 3   id            104825 non-null  object
 4   session_date  104825 non-null  object
 5   mb_used       104825 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 5.6+ MB

In [478]:
data_internet['session_date'] = pd.to_datetime(data_internet['session_date'], format='%Y-%m-%d')

In [479]:
data_internet['id'].duplicated().sum()

0

In [480]:
data_internet.head()

,user_id,city,plan,id,session_date,mb_used
0,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_13,2018-12-29,89.86
1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_204,2018-12-31,0.00
2,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_379,2018-12-28,660.40
3,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_413,2018-12-26,270.99
4,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_442,2018-12-27,880.22

In [481]:
data_internet['month'] = data_internet['session_date'].values.astype('datetime64[M]')

In [482]:
mb_month = data_internet.groupby(['user_id', 'month'])[['mb_used']].agg(['sum']).reset_index()
mb_month.columns = ['user_id', 'month', 'total_mb']

In [483]:
mb_month.head()

   user_id      month  total_mb
0     1000 2018-12-01   1901.47
1     1001 2018-08-01   6919.15
2     1001 2018-09-01  13314.82
3     1001 2018-10-01  22330.49
4     1001 2018-11-01  18504.30

In [484]:
mb_month = mb_month.merge(user_plan, on='user_id', how='left')

In [485]:
mb_plan = plans[['plan_name', 'mb_per_month_included']]
mb_plan.columns = ['plan', 'plan_mb']

In [486]:
mb_month = mb_month.merge(mb_plan, on='plan', how='left')

In [487]:
mb_month['extra_mb'] = mb_month['total_mb'] - mb_month['plan_mb']

In [488]:
mb_month['extra_mb'] = mb_month['extra_mb'].apply(count_calc)

In [489]:
def mb_gb_converter(mb):
    if mb == 0:
        return 0
    if mb > 0:
        return mb/1024

In [490]:
mb_month['extra_gb'] = mb_month['extra_mb'].apply(mb_gb_converter)

In [491]:
#write a function the checks decimal place values and performs an action

In [492]:
mb_month['extra_gb'] = mb_month['extra_gb'].round(0)

In [493]:
x = np.round([0.28, 0.50, 0.64, 0.09, 4.59, 3.28], decimals=0)

In [494]:
x

array([0., 0., 1., 0., 5., 3.])

In [495]:
extramb_plan = plans[['plan_name', 'usd_per_gb']]
extramb_plan.columns = ['plan', 'usd_per_gb']

In [496]:
mb_month = mb_month.merge(extramb_plan, on='plan', how='left')

In [497]:
mb_month['gb_cost'] = mb_month['extra_gb'] * mb_month['usd_per_gb']

In [498]:
mb_month = mb_month[['user_id', 'month', 'gb_cost']]

In [499]:
report = report.merge(mb_month, on=['user_id', 'month'], how='left')

In [500]:
report.sample(20)

,month,key,user_id,city,plan,reg_month,call_cost,msg_cost,gb_cost
2070,2018-10-01,1,1126,"Chicago-Naperville-Elgin, IL-IN-WI MSA",ultimate,2018-06-01,0.00,0.00,0.0
71,2018-02-01,1,1109,"New York-Newark-Jersey City, NY-NJ-PA MSA",surf,2018-02-01,NaN,NaN,NaN
595,2018-05-01,1,1353,"North Port-Sarasota-Bradenton, FL MSA",surf,2018-03-01,0.00,NaN,0.0
2789,2018-11-01,1,1426,"San Francisco-Oakland-Berkeley, CA MSA",ultimate,2018-07-01,0.00,NaN,0.0
319,2018-04-01,1,1132,"San Francisco-Oakland-Berkeley, CA MSA",ultimate,2018-04-01,0.00,0.00,0.0
2289,2018-10-01,1,1383,"Tampa-St. Petersburg-Clearwater, FL MSA",ultimate,2018-10-01,0.00,0.00,0.0
2145,2018-10-01,1,1217,"Dayton-Kettering, OH MSA",surf,2018-06-01,0.00,NaN,60.0
477,2018-05-01,1,1073,"Chicago-Naperville-Elgin, IL-IN-WI MSA",surf,2018-04-01,0.00,NaN,0.0
659,2018-05-01,1,1498,"New York-Newark-Jersey City, NY-NJ-PA MSA",surf,2018-02-01,0.00,NaN,70.0
1148,2018-07-01,1,1362,"Denver-Aurora-Lakewood, CO MSA",surf,2018-01-01,12.21,0.15,0.0
718,2018-06-01,1,1110,"Washington-Arlington-Alexandria, DC-VA-MD-WV MSA",surf,2018-04-01,0.00,0.72,90.0
1053,2018-07-01,1,1210,"Oklahoma City, OK MSA",surf,2018-06-01,0.78,NaN,0.0
1559,2018-08-01,1,1465,"Pittsburgh, PA MSA",ultimate,2018-06-01,0.00,0.00,0.0
2399,2018-11-01,1,1008,"Orlando-Kissimmee-Sanford, FL MSA",ultimate,2018-08-01,0.00,0.00,0.0
1033,2018-07-01,1,1174,"Cleveland-Elyria, OH MSA",surf,2018-01-01,0.48,0.75,80.0
2750,2018-11-01,1,1387,"Bridgeport-Stamford-Norwalk, CT MSA",surf,2018-05-01,3.63,0.00,30.0
1750,2018-09-01,1,1223,"Phoenix-Mesa-Chandler, AZ MSA",surf,2018-07-01,3.30,0.00,50.0
922,2018-06-01,1,1491,"Grand Rapids-Kentwood, MI MSA",surf,2018-04-01,0.00,0.12,0.0
1469,2018-08-01,1,1336,"Portland-Vancouver-Hillsboro, OR-WA MSA",surf,2018-04-01,1.38,0.72,0.0
2780,2018-11-01,1,1417,"Minneapolis-St. Paul-Bloomington, MN-WI MSA",ultimate,2018-06-01,0.00,0.00,0.0

### Profit

In [501]:
report.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3355 entries, 0 to 3354
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   month      3355 non-null   datetime64[ns]
 1   key        3355 non-null   int64
 2   user_id    3355 non-null   int64
 3   city       3355 non-null   object
 4   plan       3355 non-null   object
 5   reg_month  3355 non-null   datetime64[ns]
 6   call_cost  2258 non-null   float64
 7   msg_cost   1806 non-null   float64
 8   gb_cost    2277 non-null   float64
dtypes: datetime64[ns](2), float64(3), int64(2), object(2)
memory usage: 262.1+ KB

In [502]:
#fill in NaN values with 0
report.fillna(value=0, inplace=True)

In [503]:
report['total_cost'] = report['call_cost'] + report['msg_cost'] + report['gb_cost']

In [504]:
plan_charge = plans[['plan_name', 'usd_monthly_pay']]

In [505]:
plan_charge.columns = ['plan', 'monthly_pay']

In [506]:
report = report.merge(plan_charge, on='plan', how='left')

In [507]:
report['profit'] = report['total_cost'] + report['monthly_pay']

In [510]:
report.head()

,month,key,user_id,city,plan,reg_month,call_cost,msg_cost,gb_cost,total_cost,monthly_pay,profit
0,2018-01-01,1,1003,"Tulsa, OK MSA",surf,2018-01-01,0.0,0.0,0.0,0.0,20,20.0
1,2018-01-01,1,1011,"Cleveland-Elyria, OH MSA",ultimate,2018-01-01,0.0,0.0,0.0,0.0,70,70.0
2,2018-01-01,1,1019,"Jacksonville, FL MSA",surf,2018-01-01,0.0,0.0,0.0,0.0,20,20.0
3,2018-01-01,1,1029,"Tampa-St. Petersburg-Clearwater, FL MSA",surf,2018-01-01,0.0,0.0,0.0,0.0,20,20.0
4,2018-01-01,1,1042,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD MSA",surf,2018-01-01,0.0,0.0,0.0,0.0,20,20.0

### Data Analysis

#### Describe the customers behavior.

1. Find the minutes, texts and data users of each plan require every month.
2. Calculate:
    - mean, dispersion and standard deviation
3. Plot histograms.
    - describe the distributions

In [508]:
#create a df with for each user, each month: minutes, txts, data
#slice: surf and ultimate
#find totals of the resources in each slice in each month
    #groupby month, then find totals in each month

In [512]:
calls_month.head()

   user_id      month  call_cost
0     1000 2018-12-01        0.0
1     1001 2018-08-01        0.0
2     1001 2018-09-01        0.0
3     1001 2018-10-01        0.0
4     1001 2018-11-01        0.0

In [516]:
c = data_calls.groupby(['user_id', 'month'])[['duration']].agg(['sum']).reset_index()
c.columns = ['user_id', 'month', 'total_minutes']

In [521]:
t = data_messages.groupby(['user_id', 'month'])[['msg_count']].agg(['sum']).reset_index()
t.columns = ['user_id', 'month', 'total_msg']

In [523]:
d = data_internet.groupby(['user_id', 'month'])[['mb_used']].agg(['sum']).reset_index()
d.columns=['user_id', 'month', 'total_data']

In [525]:
r = months.merge(users, on='key')

In [529]:
r = r[['user_id','month', 'city', 'plan']]

In [531]:
r = r.merge(c, on=['user_id', 'month'], how='left')

In [533]:
r = r.merge(t,on=['user_id', 'month'], how='left' )

In [535]:
r = r.merge(d, on=['user_id', 'month'], how='left')

In [538]:
r.fillna(value=0, inplace=True)

In [541]:
r.head()

,user_id,month,city,plan,total_minutes,total_msg,total_data
0,1000,2018-01-01,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,0.0,0.0,0.0
1,1001,2018-01-01,"Seattle-Tacoma-Bellevue, WA MSA",surf,0.0,0.0,0.0
2,1002,2018-01-01,"Las Vegas-Henderson-Paradise, NV MSA",surf,0.0,0.0,0.0
3,1003,2018-01-01,"Tulsa, OK MSA",surf,0.0,0.0,0.0
4,1004,2018-01-01,"Seattle-Tacoma-Bellevue, WA MSA",surf,0.0,0.0,0.0

In [543]:
r_surf = r.query('plan == "surf"')

In [544]:
r_ultimate = r.query('plan == "ultimate"')

In [548]:
r_surf_monthly = r_surf.pivot_table(index='month', values=['total_minutes', 'total_msg', 'total_data'], aggfunc=['sum'])

In [552]:
r_surf_monthly.columns = ['total_data', 'total_minutes', 'total_msg']

In [553]:
r_surf_monthly

            total_data  total_minutes  total_msg
month
2018-01-01     9749.72         385.68       21.0
2018-02-01   109609.59        2527.66      108.0
2018-03-01   306945.12        7152.31      351.0
2018-04-01   599210.15       16619.00      870.0
2018-05-01  1073099.33       29033.10     1849.0
2018-06-01  1484248.33       39499.26     2454.0
2018-07-01  2030815.67       51367.31     3271.0
2018-08-01  2720843.68       62721.48     4662.0
2018-09-01  3218737.67       75852.46     5968.0
2018-10-01  4102786.41       96149.09     8020.0
2018-11-01  4624009.00      113086.75     9165.0
2018-12-01  5766125.26      142297.14    12275.0

In [559]:
r_ultimate_monthly = r_ultimate.pivot_table(index='month', values=['total_minutes', 'total_msg', 'total_data'], aggfunc=['sum'])

In [560]:
r_ultimate_monthly.columns = ['total_data', 'total_minutes', 'total_msg']

In [561]:
r_ultimate_monthly

            total_data  total_minutes  total_msg
month
2018-01-01    27672.37         732.65       62.0
2018-02-01   119901.66        2659.03      151.0
2018-03-01   219858.22        3428.42      243.0
2018-04-01   338554.75        6646.67      463.0
2018-05-01   482109.99       11126.28      931.0
2018-06-01   720882.29       16441.12     1379.0
2018-07-01   964339.92       23822.27     1937.0
2018-08-01  1264845.13       28206.51     2732.0
2018-09-01  1459408.78       35542.71     3259.0
2018-10-01  1866930.66       45067.81     4181.0
2018-11-01  2163278.04       53400.65     4903.0
2018-12-01  2766801.97       65384.90     6796.0

In [509]:
#slice:surf and ultimate for every month
#mean = .mean() of minutes, text, data
#dispersion = 
#standard deviation = .std() of ""